### 1. 파일을 DataFrame으로 로딩, 기본 API
- kaggle의 타이타닉 train.csv 파일 이용
- read_csv(), read_table(), read_fwf() : 파일을 DataFrame으로 로딩할 수 있는 API
- read_csv() : 디폴트 필드 구분 문자 ','
- read_table() : 디폴트 필드 구분 문자 '\t' (read_csv()와 구분 문자말고 큰 차이 없음)
- read_fwf() : 고정 길이 기반의 칼럼 포맷 로드

In [1]:
import pandas as pd

# 파일 불러오기
titanic_df = pd.read_csv('/content/drive/My Drive/titanic_train.csv')
titanic_df.head(3) # 위에서 세 줄만 출력

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[3 rows x 12 columns]

In [2]:
titanic_df = pd.read_csv('/content/drive/My Drive/titanic_train.csv')
print('titanic 변수 type:', type(titanic_df))
titanic_df

titanic 변수 type: <class 'pandas.core.frame.DataFrame'>

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

- df.shape : DataFrame의 행과 열 크기를 튜플 형태로 반환

In [3]:
print('DataFrame 크기:', titanic_df.shape)

DataFrame 크기: (891, 12)

- info() / describe() : 칼럼 타입, Null 데이터 개수, 데이터 분포도 등 메타 데이터 조회 메서드

In [4]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

- info() : 데이터 건수, 데이터 타입, Null 건수 파악 가능

In [5]:
titanic_df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

- describe() : 숫자형 데이터의 n-percentile 분포도, 평균값, 최댓값, 최솟값 파악 가능

- DataFrame의 [ ] 연산자 내부에 칼럼명 입력 → 시리즈 형태로 특정 칼럼 데이터셋 반환
- value.counts() : 해당 칼럼값의 유형, 건수 확인

In [6]:
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [7]:
titanic_pclass = titanic_df['Pclass']
print(type(titanic_pclass))

<class 'pandas.core.series.Series'>

In [8]:
# 앞 5개 데이터만 추출
titanic_pclass.head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

### 2. DataFrame, list, dictionary, ndarray 상호 변환

1) ndarray, list, dictionary → DataFrame
- DataFrame : 행과 열을 가지는 2차원 데이터 → 2차원 이하 데이터들만 DataFrame으로 변환 가능

In [9]:
# 1차원 데이터로 DataFrame 생성

import numpy as np

col_name1 = ['col1']
list1 = [1, 2, 3] # list 생성
array1 = np.array(list1) # ndarray 생성
print('array1 shpae:', array1.shape)

# list → DataFrame 생성
df_list1 = pd.DataFrame(list1, columns = col_name1)
print('1차원 리스트로 만든 DataFrame:\n', df_list1)

# ndarray → DataFrame 생성
df_array1 = pd.DataFrame(array1, columns = col_name1)
print('1차원 ndarray로 만든 DataFrame:\n', df_array1)

array1 shpae: (3,)
1차원 리스트로 만든 DataFrame:
    col1
0     1
1     2
2     3
1차원 ndarray로 만든 DataFrame:
    col1
0     1
1     2
2     3

In [10]:
# 2차원 데이터로 DataFrame 생성

# 3개 칼럼명 필요
col_name2 = ['col1', 'col2', 'col3']

# 2x3 list, ndarray 생성 → DataFrame으로 변환
list2 = [[1, 2, 3],
         [11, 12, 13]]
array2 = np.array(list2)
print('array2 shpae:', array2.shape)

df_list2 = pd.DataFrame(list2, columns = col_name2)
print('2차원 리스트로 만든 DataFrame:\n', df_list2)

df_array2 = pd.DataFrame(array2, columns = col_name2)
print('2차원 ndarray로 만든 DataFrame:\n', df_array2)

array2 shpae: (2, 3)
2차원 리스트로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13
2차원 ndarray로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13

In [11]:
# dictionary → DataFrame
# key : 칼럼명, value : 키에 해당하는 칼럼 데이터로 변환

dict = {'col1':[1, 11], 'col2' : [2, 22], 'col3' : [3, 33]}
df_dict = pd.DataFrame(dict)
print('딕셔너리로 만든 DataFrame:\n', df_dict)

딕셔너리로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    22    33

2) DataFrame → ndarray, list, dictionary

In [12]:
# DataFrame → ndarray
# values 사용
array3 = df_dict.values # df_dict의 values 저장
print('df_dict.values 타입:', type(array3), 'df_dict.values shape:', array3.shape)
print(array3)

df_dict.values 타입: <class 'numpy.ndarray'> df_dict.values shape: (2, 3)
[[ 1  2  3]
 [11 22 33]]

In [13]:
# DataFrame → list
# values로 얻은 ndarray에 tolist() 호출
list3 = df_dict.values.tolist()
print('df_dict.values.tolist() 타입:', type(list3))
print(list3)

# DataFrame → dictionary
# DataFrame의 to_dict() 메서드 사용. 인자로 'list' 입력 시 list로 반환
dict3 = df_dict.to_dict('list')
print('\n df_dict.to_dict() 타입:', type(dict3))
print(dict3)

df_dict.values.tolist() 타입: <class 'list'>
[[1, 2, 3], [11, 22, 33]]

 df_dict.to_dict() 타입: <class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

### 3. 칼럼 데이터셋 생성, 수정

- DataFrame의 [ ] 연산자 이용

In [14]:
titanic_df['Age_0'] = 0
titanic_df.head(3)

   PassengerId  Survived  Pclass  ... Cabin Embarked  Age_0
0            1         0       3  ...   NaN        S      0
1            2         1       1  ...   C85        C      0
2            3         1       3  ...   NaN        S      0

[3 rows x 13 columns]

- 마지막 칼럼으로 'Age_0' 생성되었으며, 그 값이 0으로 할당됨

- 기존 칼럼 series를 가공, 새로운 칼럼 생성

In [15]:
titanic_df['Age_by_10'] = titanic_df['Age'] * 10
titanic_df['Family_No'] = titanic_df['SibSp'] + titanic_df['Parch'] + 1
titanic_df.head(3)

   PassengerId  Survived  Pclass  ... Age_0 Age_by_10  Family_No
0            1         0       3  ...     0     220.0          2
1            2         1       1  ...     0     380.0          2
2            3         1       3  ...     0     260.0          1

[3 rows x 15 columns]

- DataFrame 내의 기존 칼럼 값 업데이트

In [16]:
titanic_df['Age_by_10'] = titanic_df['Age_by_10'] + 100
titanic_df.head(3)

   PassengerId  Survived  Pclass  ... Age_0 Age_by_10  Family_No
0            1         0       3  ...     0     320.0          2
1            2         1       1  ...     0     480.0          2
2            3         1       3  ...     0     360.0          1

[3 rows x 15 columns]

### 4. 데이터 삭제
- drop( ) 메서드 사용
- 디폴트 값 : DataFrame.drop(labels = None, axis = 0, index = None, columns = None, level = None, inplace = False, errors = 'raise')
- axis = 0 : row 방향 / axis = 1 : column 방향

In [17]:
# 'Age_0' 칼럼 삭제
titanic_drop_df = titanic_df.drop('Age_0', axis = 1)
titanic_drop_df.head(3)

   PassengerId  Survived  Pclass  ... Embarked Age_by_10  Family_No
0            1         0       3  ...        S     320.0          2
1            2         1       1  ...        C     480.0          2
2            3         1       3  ...        S     360.0          1

[3 rows x 14 columns]

In [18]:
titanic_df.head(3)

   PassengerId  Survived  Pclass  ... Age_0 Age_by_10  Family_No
0            1         0       3  ...     0     320.0          2
1            2         1       1  ...     0     480.0          2
2            3         1       3  ...     0     360.0          1

[3 rows x 15 columns]

- 'Age_0' 칼럼 존재 → 'inplace = False' 이기 때문
- inplace = False : 원본 데이터는 유지하고 반환
- inplace = True : 원본 데이터에 적용

In [19]:
# 원본 데이터의 'Age_0', 'Age_by_10', 'Family_No' 칼럼 삭제
drop_result = titanic_df.drop(['Age_0', 'Age_by_10', 'Family_No'], axis = 1, inplace = True)
print('inplace = True로 drop 후 반환된 값:', drop_result)
titanic_df.head(3)

inplace = True로 drop 후 반환된 값: None

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[3 rows x 12 columns]

In [20]:
# axis = 0 → index 삭제
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 15)
print('#### before axis 0 drop ####')
print(titanic_df.head(3))

titanic_df.drop([0, 1, 2], axis = 0, inplace = True)
print('#### after axis 0 drop ####')
print(titanic_df.head(3))

#### before axis 0 drop ####
   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[3 rows x 12 columns]
#### after axis 0 drop ####
   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q

[3 rows x 12 columns]

- 인덱스 0, 1, 2에 해당하는 row가 삭제되었음을 확인 가능

### 5. 데이터 셀렉션 및 필터링

1) DataFrame의 [ ] 연산자
- [  ]('칼럼 지정 연산자') 안에 들어갈 수 있는 것: 칼럼 명, 인덱스로 변환 가능한 표현식

In [21]:
titanic_df = pd.read_csv('/content/drive/My Drive/titanic_train.csv')

# 단일 칼럼 추출
print('단일 칼럼 데이터 추출:\n', titanic_df['Pclass'].head(3))

# 다중 칼럼 추출: [] 안에 ['칼럼1', '칼럼2']와 같이 리스트 객체 이용
print('\n 다중 칼럼 데이터 추출:\n', titanic_df[['Survived', 'Pclass']].head(3))

단일 칼럼 데이터 추출:
 0    3
1    1
2    3
Name: Pclass, dtype: int64

 다중 칼럼 데이터 추출:
    Survived  Pclass
0         0       3
1         1       1
2         1       3

In [22]:
# 불린 인덱싱
titanic_df[titanic_df['Pclass'] == 3].head(3)

   PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
0            1         0       3  ...  7.250   NaN         S
2            3         1       3  ...  7.925   NaN         S
4            5         0       3  ...  8.050   NaN         S

[3 rows x 12 columns]

- 슬라이싱 연산은 DataFrame에는 되도록 사용하지 말 것

2) iloc[ ] 연산자
- 위치 기반 인덱싱 → 행, 열 값으로 int 또는 int 슬라이싱, 팬시 리스트 값 입력

In [23]:
# 샘플 데이터 생성
data = {'Name': ['Chulmin', 'Eunkyung', 'Jinwoong', 'Soobeom'],
        'Year': [2011, 2016, 2015, 2015],
        'Gender': ['Male', 'Female', 'Male', 'Male']}

data_df = pd.DataFrame(data, index = ['one', 'two', 'three', 'four'])
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [24]:
# 첫 번째 행, 첫 번째 열 추출
data_df.iloc[0, 0]

'Chulmin'

In [25]:
# 명칭 입력시 오류 발생
data_df.iloc[0, 'Name']

ValueError: ignored

3) loc[ ] 연산자
- 명칭 기반 인덱싱 → 행 위치 : index, 열 위치 : 칼럼 명

In [26]:
# 인덱스 one, 칼럼 명 name인 데이터 추출
data_df.loc['one', 'Name']

'Chulmin'

4) 불린 인덱싱
- [ ], ix[ ], loc[ ] 에서 공통으로 지원
- iloc[ ]의 경우, 정수형 값이 아닌 경우 지원하지 않기에 불린 인덱싱 적용 불가

In [27]:
# 불린 인덱싱 → 'Age'가 60보다 큰 값만 추출
titanic_boolean = titanic_df[titanic_df['Age'] > 60]
print(type(titanic_boolean))
titanic_boolean

<class 'pandas.core.frame.DataFrame'>

     PassengerId  Survived  Pclass  ...      Fare        Cabin  Embarked
33            34         0       2  ...   10.5000          NaN         S
54            55         0       1  ...   61.9792          B30         C
96            97         0       1  ...   34.6542           A5         C
116          117         0       3  ...    7.7500          NaN         Q
170          171         0       1  ...   33.5000          B19         S
252          253         0       1  ...   26.5500          C87         S
275          276         1       1  ...   77.9583           D7         S
280          281         0       3  ...    7.7500          NaN         Q
326          327         0       3  ...    6.2375          NaN         S
438          439         0       1  ...  263.0000  C23 C25 C27         S
456          457         0       1  ...   26.5500          E38         S
483          484         1       3  ...    9.5875          NaN         S
493          494         0       1  ...   49.5042          NaN         C
545          546         0       1  ...   26.0000          NaN         S
555          556         0       1  ...   26.5500          NaN         S
570          571         1       2  ...   10.5000          NaN         S
625          626         0       1  ...   32.3208          D50         S
630          631         1       1  ...   30.0000          A23         S
672          673         0       2  ...   10.5000          NaN         S
745          746         0       1  ...   71.0000          B22         S
829          830         1       1  ...   80.0000          B28       NaN
851          852         0       3  ...    7.7750          NaN         S

[22 rows x 12 columns]

- 불린 인덱싱 객체 타입: DataFrame → 원하는 칼럼 명만 별도로 추출하는 것이 가능

In [28]:
# 불린 인덱싱 → 나이, 이름 추출
titanic_df[titanic_df['Age'] > 60][['Name', 'Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [29]:
# loc[] 이용: 불린 인덱싱은 행 위치, 추출하고자 하는 칼럼은 칼럼 위치에
titanic_df.loc[titanic_df['Age'] > 60, ['Name', 'Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [30]:
# 복합 조건
# 나이가 60세 이상, 선실 등급 1등급, 성별 여성
titanic_df[(titanic_df['Age'] > 60) & (titanic_df['Pclass'] == 1) & (titanic_df['Sex'] == 'female')]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
275          276         1       1  ...  77.9583    D7         S
829          830         1       1  ...  80.0000   B28       NaN

[2 rows x 12 columns]

### 6. 정렬, Aggregation, GroupBy

1) 정렬: sort_values( )
- SQL의 order by와 유사
- 주요 파라미터: by, ascending, inplace
- by: 특정 칼럼 입력시 해당 칼럼으로 정렬
- ascending = True (기본값): 오름차순 (False: 내림차순)
- inplace = False (기본값): 원본 유지 후 정렬된 값 반환

In [31]:
# 'Name' 칼럼 오름차순 정렬
titanic_sorted = titanic_df.sort_values(by = ['Name'])
titanic_sorted.head(3)

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
845          846         0       3  ...   7.55   NaN         S
746          747         0       3  ...  20.25   NaN         S
279          280         1       3  ...  20.25   NaN         S

[3 rows x 12 columns]

- 여러 칼럼 정렬: 리스트 형식으로 입력

In [32]:
# 'Pclass', 'Name' 칼럼 기준 내림차순 정렬
titanic_sorted = titanic_df.sort_values(by = ['Pclass', 'Name'], ascending = False)
titanic_sorted.head(3)

     PassengerId  Survived  Pclass  ...  Fare Cabin  Embarked
868          869         0       3  ...   9.5   NaN         S
153          154         0       3  ...  14.5   NaN         S
282          283         0       3  ...   9.5   NaN         S

[3 rows x 12 columns]

2) Aggregation
- min( ): 최소값
- max( ): 최대값
- mean( ): 평균
- sum( ): 합계
- count( ): 갯수
- DataFrame에 적용 시 모든 칼럼에 적용

In [33]:
# 모든 칼럼에 count() 적용
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [34]:
# 특정 칼럼에 적용 평균값 적용
titanic_df[['Age', 'Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

3) groupby( )
- 파라미터 by에 칼럼 입력 → 대상 칼럼으로 groupby
- DataFrame에 groupby( ) 호출 → 'DataFrameGroupBy' 라는 형태의 DataFrame 반환

In [35]:
# 'Pclass' 기준 GroupBy
titanic_groupby = titanic_df.groupby(by = 'Pclass')
print(type(titanic_groupby))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [36]:
# GroupBy 후 모든 칼럼에 aggregation 적용
titanic_groupby = titanic_df.groupby('Pclass').count()
titanic_groupby

        PassengerId  Survived  Name  Sex  ...  Ticket  Fare  Cabin  Embarked
Pclass                                    ...
1               216       216   216  216  ...     216   216    176       214
2               184       184   184  184  ...     184   184     16       184
3               491       491   491  491  ...     491   491     12       491

[3 rows x 11 columns]

In [37]:
# GroupBy 후 특정 칼럼에 aggregation 적용
titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId', 'Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [38]:
# 여러 aggregation 적용: agg( ) 인자로 aggregation 함수 입력
titanic_df.groupby('Pclass')['Age'].agg([max, min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

### 7. 결손 데이터 처리
- 결손 데이터: NULL 값. 넘파이의 NaN으로 표시
- 머신러닝 알고리즘 → NaN 값을 처리하지 않음 → 다른 값으로 대체해야 함
- isna( ): NaN 여부 확인
- fillna( ): NaN 값을 다른 값으로 대체

1) 결손 데이터 확인

In [39]:
# isna() 사용
titanic_df.isna().head(3)

   PassengerId  Survived  Pclass   Name  ...  Ticket   Fare  Cabin  Embarked
0        False     False   False  False  ...   False  False   True     False
1        False     False   False  False  ...   False  False  False     False
2        False     False   False  False  ...   False  False   True     False

[3 rows x 12 columns]

In [40]:
# 결손 데이터 개수 확인(True는 1, False는 0)
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

2) 결손 데이터 대체

In [41]:
# 'Cabin' 칼럼 결손값 → 'C000' 으로 대체
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df.head(3)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500  C000         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250  C000         S

[3 rows x 12 columns]

- 반환 값을 다시 받거나, inplace = True 파라미터를 추가해야 실제 데이터 값이 변경됨

In [42]:
# 여러 칼럼 결손 데이터 대체
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

### 8. apply lambda
- lambda: 파이썬에서 함수형 프로그래밍을 지원하기 위해 만들어짐
- 함수의 선언, 함수 내의 처리를 한 줄의 식으로 변환하는 식

In [44]:
# 제곱 값 반환하는 함수 생성
def get_square(a):
  return a**2

print('3의 제곱은:', get_square(3))

3의 제곱은: 9

In [45]:
# get_square( ) → lambda 변환
lambda_square = lambda x: x ** 2
print('3의 제곱은:', lambda_square(3))

3의 제곱은: 9

- ':' 왼쪽의 x → 입력 인자
- ':' 오른쪽   → 입력 인자의 계산식(반환 값)

- 여러 개의 입력 인자 → map( ) 함수 결합

In [46]:
a = [1, 2, 3]
squares = map(lambda x: x ** 2, a)
list(squares)

[1, 4, 9]

In [48]:
# 'Name' 칼럼 문자열 개수 → 별도 칼럼 생성
titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x: len(x))
titanic_df[['Name', 'Name_len']].head(3)

             Name  Name_len
0  Braund, Mr....        23
1  Cumings, Mr...        51
2  Heikkinen, ...        22

In [49]:
# lambda 식에 if else 절 사용
# 15세 미만이면 'Child', 아니면 'Adult' 구분하는 칼럼 'Child_Adult' 생성
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x: 'Child' if x <=  15 else 'Adult')
titanic_df[['Age', 'Child_Adult']].head(8)

         Age Child_Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       Child

- if 절의 경우 if 식보다 반환 값을 먼저 기술
- if, else만 지원하며 else if는 지원하지 않음

In [51]:
# 15세 이하 → Child, 15세 ~ 60세 → Adult, 61세 → Elderly
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x: 'Child' if x <= 15 else ('Adult' if x <= 60 else 'Elderly'))
titanic_df['Age_cat'].value_counts()

Adult      786
Child       83
Elderly     22
Name: Age_cat, dtype: int64

In [52]:
# 나이를 세분화하여 분류하는 함수 생성
def get_category(age):
  cat = ''
  if age <= 5: cat = 'Baby'
  elif age <= 12: cat = 'Child'
  elif age <= 18: cat = 'Teenage'
  elif age <= 25: cat = 'Student'
  elif age <= 35: cat = 'Young Adult'
  elif age <= 60: cat = 'Adult'
  else: cat = 'Elderly'

  return cat

# lambda 식에 함수 적용
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x: get_category(x))
titanic_df[['Age', 'Age_cat']].head()

    Age      Age_cat
0  22.0      Student
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult